snlkuharlocal/src/DocumentJournals/Складские/Складские.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DocumentJournal>
  <name>Складские</name>
  <registeredDocuments>Document.РасходнаяНакладная</registeredDocuments>
  <registeredDocuments>Document.ПриходнаяНакладная</registeredDocuments>
  <registeredDocuments>Document.Перемещение</registeredDocuments>
  <columns>
    <name>Склад</name>
  </columns>
  <columns>
    <name>Получатель</name>
  </columns>
  <columns>
    <name>Сумма</name>
  </columns>
  <columns>
    <name>ИБ</name>
  </columns>
  <columns>
    <name>КодОперации</name>
  </columns>
  <columns>
    <name>Отгружен</name>
  </columns>
  <columns>
    <name>ВидОплаты</name>
  </columns>
  <columns>
    <name>ДатаОтгрузки</name>
  </columns>
  <columns>
    <name>СостояниеНакладной</name>
  </columns>
  <columns>
    <name>ГруппыТоваров</name>
  </columns>
  <columns>
    <name>Валюта</name>
  </columns>
  <columns>
    <name>ОбъемДокумента</name>
  </columns>
  <columns>
    <name>Состояние</name>
  </columns>
  <columns>
    <name>Менеджер</name>
  </columns>
  <columns>
    <name>Комментарий</name>
  </columns>
  <columns>
    <name>Организация</name>
  </columns>
  <columns>
    <name>Автор</name>
  </columns>
  <columns>
    <name>ПунктДоставки</name>
  </columns>
  <columns>
    <name>Количество</name>
  </columns>
  <columns>
    <name>НеСоответствуетЗаявке</name>
  </columns>
  <columns>
    <name>СостояниеДокументов</name>
  </columns>
  <columns>
    <name>ТипЦен</name>
  </columns>
  <columns>
    <name>ЛевыйКонтрагент</name>
  </columns>
  <columns>
    <name>СостояниеНакладнойУПолучателя</name>
  </columns>
  <columns>
    <name>ДатаПриемки</name>
  </columns>
  <columns>
    <name>Скидка</name>
  </columns>
  <columns>
    <name>Договор</name>
  </columns>
  <columns>
    <name>ДатаВыгрузки</name>
  </columns>
  <columns>
    <name>ДопОбработка</name>
  </columns>
  <columns>
    <name>КонтрагентЗаказа</name>
  </columns>
  <columns>
    <name>Подразделение</name>
  </columns>
  <columns>
    <name>СекторХранения</name>
  </columns>
  <columns>
    <name>ДатаОплаты</name>
  </columns>
  <columns>
    <name>ДатаОтгрузкиНаТранзит</name>
  </columns>
  <columns>
    <name>НомерЗаказа</name>
  </columns>
  <columns>
    <name>КМПЛ</name>
  </columns>
  <columns>
    <name>Корр</name>
  </columns>
  <columns>
    <name>КоличествоПаллет</name>
  </columns>
  <columns>
    <name>ОбъемПаллет</name>
  </columns>
  <columns>
    <name>НужноПаллетирование</name>
  </columns>
  <columns>
    <name>ОбъемКоробов</name>
  </columns>
  <columns>
    <name>КоличествоКоробок</name>
  </columns>
  <columns>
    <name>КодВторичногоКонтрагента</name>
  </columns>
  <columns>
    <name>НомерЗаказаВторичногоКонтрагента</name>
  </columns>
  <columns>
    <name>НаименованиеВторичногоКонтрагента</name>
  </columns>
  <columns>
    <name>ТребуетсяМаркировка</name>
  </columns>
  <columns>
    <name>КоличествоКомплектующих</name>
  </columns>
  <columns>
    <name>ДатаГотовности</name>
  </columns>
</mdclass:DocumentJournal>

snlkuharlocal/src/Enums/СостоянияНакладной/СостоянияНакладной.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СостоянияНакладной</name>
  <enumValues>
    <name>ВРаботе</name>
  </enumValues>
  <enumValues>
    <name>КОтправкеНаСклад</name>
    <comment>Накладная готова к отправке на склад</comment>
  </enumValues>
  <enumValues>
    <name>ПолученоСкладом</name>
  </enumValues>
  <enumValues>
    <name>ВНаборе</name>
  </enumValues>
  <enumValues>
    <name>Сканирование</name>
  </enumValues>
  <enumValues>
    <name>ГотоваКОтгрузке</name>
  </enumValues>
  <enumValues>
    <name>Отгружена</name>
  </enumValues>
  <enumValues>
    <name>Принята</name>
    <comment>Накладная оприходована складом</comment>
  </enumValues>
  <enumValues>
    <name>ГотоваКПриемке</name>
  </enumValues>
  <enumValues>
    <name>КОтправкеВОфис</name>
  </enumValues>
  <enumValues>
    <name>ПолученоОфисом</name>
  </enumValues>
  <enumValues>
    <name>Доставлена</name>
  </enumValues>
  <enumValues>
    <name>ПринятаНаТранзитныйСклад</name>
    <comment>Накладная приянта на транзитный склад</comment>
  </enumValues>
  <enumValues>
    <name>ОтгруженаНаТранзитныйСклад</name>
    <comment>Накладная приянта на транзитный склад</comment>
  </enumValues>
  <enumValues>
    <name>РезервУпаковки</name>
  </enumValues>
  <enumValues>
    <name>ОжиданиеОплаты</name>
  </enumValues>
  <enumValues>
    <name>ДопОбработка</name>
  </enumValues>
  <enumValues>
    <name>ДоставленаНаСклад</name>
  </enumValues>
  <enumValues>
    <name>ВМашине</name>
  </enumValues>
  <enumValues>
    <name>ОжиданиеНабора</name>
  </enumValues>
  <enumValues>
    <name>ОжиданиеСканирования</name>
  </enumValues>
  <enumValues>
    <name>ОжиданиеДопОбработки</name>
  </enumValues>
  <enumValues>
    <name>ОжиданиеПереукладки</name>
  </enumValues>
  <enumValues>
    <name>Переукладка</name>
  </enumValues>
  <enumValues>
    <name>ВЗонеХранения</name>
  </enumValues>
  <enumValues>
    <name>ПроверенаПоОстаткам</name>
  </enumValues>
  <enumValues>
    <name>ОжиданиеПаллетирования</name>
  </enumValues>
  <enumValues>
    <name>Паллетирование</name>
  </enumValues>
  <enumValues>
    <name>ОжиданиеТермоусадки</name>
  </enumValues>
  <enumValues>
    <name>Термоусадка</name>
  </enumValues>
  <enumValues>
    <name>СформированыЗаданияНабора</name>
  </enumValues>
  <enumValues>
    <name>ОжиданиеКорректировки</name>
  </enumValues>
  <enumValues>
    <name>Отменена</name>
  </enumValues>
  <enumValues>
    <name>ОжиданиеКомплектацииЧЗ</name>
  </enumValues>
  <enumValues>
    <name>КомплектацияЧЗ</name>
  </enumValues>
  <enumValues>
    <name>ЗаказКМЧЗ</name>
  </enumValues>
  <enumValues>
    <name>ОжиданиеОбработкиЧЗ</name>
  </enumValues>
</mdclass:Enum>

snlkuharlocal/src/Documents/КоллективныеРаботы/КоллективныеРаботы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>КоллективныеРаботы</name>
  <basedOn>Document.ПриходнаяНакладная</basedOn>
  <basedOn>Document.ЛистЗагрузки</basedOn>
  <basedOn>Document.РасходнаяНакладная</basedOn>
  <basedOn>Document.Комплектация</basedOn>
  <attributes>
    <name>ДатаПрибытия</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачалаРабот</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоСотрудников</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПриостановкаРабот</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ВозобновлениеРабот</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончанияРабот</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаУбытия</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоСтрокДокОснования</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоКоробов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоЧеловекоЧасов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВидРаботы</name>
    <type>
      <types>CatalogRef.ВидыВыполняемыхРабот</types>
    </type>
  </attributes>
  <attributes>
    <name>Состояние</name>
    <type>
      <types>EnumRef.СостоянияНакладной</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокОснование</name>
    <type>
      <types>DocumentRef.Комплектация</types>
      <types>DocumentRef.ЗаданиеНабора</types>
      <types>DocumentRef.ЛистМаркировкиОстатков</types>
      <types>DocumentRef.ПриходнаяНакладная</types>
      <types>DocumentRef.ЛистСборкиКомплектовЧЗ</types>
      <types>DocumentRef.ЗаданиеНаСборкуКомплектовЧЗ</types>
      <types>DocumentRef.РасходнаяНакладная</types>
      <types>DocumentRef.ЗаданиеНаМаркировку</types>
      <types>DocumentRef.ЛистЗагрузки</types>
      <types>DocumentRef.Перемещение</types>
    </type>
  </attributes>
  <attributes>
    <name>ПаузаВРаботе</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>20</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВремяПростояДоВыгрузки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>20</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВремяРаботы</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>20</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВремяРаботыЧистое</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>20</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВремяПребыванияОбщее</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>20</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоШтук</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоПаллет</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>13</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РабочееМесто</name>
    <type>
      <types>CatalogRef.РабочиеМеста</types>
    </type>
  </attributes>
  <attributes>
    <name>ПоследняяРабота</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>БригадаСформирована</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Данные</name>
    <attributes>
      <name>ВидРаботы</name>
      <type>
        <types>CatalogRef.ВидыВыполняемыхРабот</types>
      </type>
    </attributes>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.ФизическиеЛица</types>
      </type>
    </attributes>
    <attributes>
      <name>НачалоВыполнения</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>ОкончаниеВыполнения</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>НачалоПаузы</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>ПродолжительностьПаузы</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>20</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЧеловекоЧасов</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВедущийСотрудник</name>
      <type>
        <types>CatalogRef.ФизическиеЛица</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Накладные</name>
    <attributes>
      <name>Накладная</name>
      <type>
        <types>DocumentRef.Комплектация</types>
        <types>DocumentRef.ЗаданиеНабора</types>
        <types>DocumentRef.ЛистМаркировкиОстатков</types>
        <types>DocumentRef.ПриходнаяНакладная</types>
        <types>DocumentRef.ЛистСборкиКомплектовЧЗ</types>
        <types>DocumentRef.ЗаданиеНаСборкуКомплектовЧЗ</types>
        <types>DocumentRef.РасходнаяНакладная</types>
        <types>DocumentRef.ЗаданиеНаМаркировку</types>
        <types>DocumentRef.ЛистЗагрузки</types>
        <types>DocumentRef.Перемещение</types>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоКоробок</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоСтрок</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоШтук</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоПаллет</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>13</precision>
          <scale>4</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

snlkuharlocal/src/DocumentJournals/Складские/ManagerModule.bsl
// Шворобей ВЮ 28.07.2025 https://yougile.collant.ru/team/ab6bad3a05c0/#HELP-5976
#Область КоллективныеРаботы

Функция СоздатьКоллективныеРаботыСВидомДопОбработки(МассивНакладных, ДопОбработка = Неопределено, Сотрудник = Неопределено) Экспорт
	
	КоллективнаяРабота = Документы.КоллективныеРаботы.СоздатьДокумент();
	
	Если ЗначениеЗаполнено(ДопОбработка) Тогда
		КоллективнаяРабота.ВидРаботы = ДопОбработка; // Справочники.ВидыВыполняемыхРабот.ДопОбработка;
	Иначе
		КоллективнаяРабота.ДополнительныеСвойства.Вставить("НеЗаполнятьВидРаботы", Истина);
	КонецЕсли;
	КоллективнаяРабота.ДатаНачалаРабот = ТекущаяДатаСеанса();
	КоллективнаяРабота.Состояние = Перечисления.СостоянияНакладной.ВРаботе;
	
	Для Каждого Накладная из МассивНакладных цикл
		СтрТЧ = КоллективнаяРабота.Накладные.Добавить();		
		СтрТЧ.Накладная = Накладная;
		МетаданныеДокумента = Накладная.Метаданные();
		
		СтрТЧ.КоличествоКоробок = Накладная.КоличествоКоробок;
		СтрТЧ.КоличествоСтрок = Накладная.Товары.Количество();
		СтрТЧ.КоличествоПаллет = Накладная.КоличествоПаллет;		
		
		Если ЕстьТабЧастьДокумента("Товары", МетаданныеДокумента) Тогда
			тзТовары = СтрТЧ.Накладная.Товары.Выгрузить();
		ИначеЕсли ЕстьТабЧастьДокумента("ШтрихкодыУпаковок", МетаданныеДокумента) Тогда
			тзШтрихкодыУпаковок = СтрТЧ.Накладная.ШтрихкодыУпаковок.Выгрузить();
			тзТовары = Документы.КоллективныеРаботы.ПреобразоватьШтрихкодыУпаковокВТовары(тзШтрихкодыУпаковок);
		КонецЕсли;

		СтрТЧ.КоличествоШтук = Документы.КоллективныеРаботы.НайтиКоличествоКомплектующих(тзТовары);
	КонецЦикла;	
	
	Если ЗначениеЗаполнено(Сотрудник) Тогда
		
		СтрТЧ = КоллективнаяРабота.Данные.Добавить();
		СтрТЧ.ВедущийСотрудник = Сотрудник;
		СтрТЧ.Сотрудник = Сотрудник;
		СтрТЧ.ВидРаботы = КоллективнаяРабота.ВидРаботы;
		СтрТЧ.НачалоВыполнения = ТекущаяДатаСеанса();
		
		// Кельманов А.В. - ИЗМ-0000000062 - 2026.06.26 {
	Иначе
		
		ТекБригада = ТекущаяБригада(Ложь);
		ТекНачалоВыполнения = ТекущаяДатаСеанса();
		ТекВедущийСотрудник = ПредопределенноеЗначение("Справочник.ФизическиеЛица.ПустаяСсылка");
		
		Для Каждого Стр Из ТекБригада Цикл
			
			СтрТЧ = КоллективнаяРабота.Данные.Добавить();
			
			Если Не ЗначениеЗаполнено(ТекВедущийСотрудник) Тогда
				
				ТекВедущийСотрудник = Стр.Сотрудник;
				
			КонецЕсли;
			
			СтрТЧ.ВедущийСотрудник = ТекВедущийСотрудник;
			СтрТЧ.Сотрудник = Стр.Сотрудник;
			СтрТЧ.ВидРаботы = КоллективнаяРабота.ВидРаботы;
			СтрТЧ.НачалоВыполнения = ТекНачалоВыполнения;
			
		КонецЦикла;
		// Кельманов А.В. - ИЗМ-0000000062 - 2026.06.26 }
		
	КонецЕсли;
	
	КоллективнаяРабота.ДополнительныеСвойства.Вставить("Автозаполнение", Истина); // Кельманов А.В. - SNL-189 - 2026.04.24
	
	Попытка
		КоллективнаяРабота.Записать(РежимЗаписиДокумента.Проведение);
		//+++Чирков 16.01.2026
		//Возврат КоллективнаяРабота;
		Возврат КоллективнаяРабота.Ссылка;
		//---Чирков 16.01.2026
	Исключение
		Сообщить(ОписаниеОшибки());
	КонецПопытки;
	
КонецФункции

Функция ЗакрыватьКоллективныеРаботы(Сотрудник = Неопределено) Экспорт
	
	МассивЗакрытия = Новый Массив;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ДатаЗапретаРедактирование", ОбщегоНазначения_ПИ.Константа_ДатаЗапретаРедактирования());	
	Запрос.УстановитьПараметр("Сотрудник", Сотрудник);
	Запрос.Текст =
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Данные.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.КоллективныеРаботы.Данные КАК Данные
	|ГДЕ
	|	НЕ Данные.Ссылка.ПометкаУдаления
	|	И Данные.Сотрудник = &Сотрудник
	|	И Данные.Ссылка.Дата > &ДатаЗапретаРедактирование
	|	И Данные.Ссылка.ДатаОкончанияРабот = ДАТАВРЕМЯ(1, 1, 1)";
	
	УстановитьПривилегированныйРежим(Истина);
	Выборка = Запрос.Выполнить().Выбрать();
	УстановитьПривилегированныйРежим(Ложь);
	
	Пока Выборка.Следующий() Цикл
		ДокОбъект = Выборка.Ссылка.ПолучитьОбъект();
		Если ДокОбъект <> Неопределено Тогда
			ДокОбъект.Состояние = Перечисления.СостоянияНакладной.Отгружена;
			ДокОбъект.ДатаОкончанияРабот = ТекущаяДатаСеанса();
			Для Каждого Стр ИЗ ДокОбъект.Данные Цикл
				Стр.ОкончаниеВыполнения = ДокОбъект.ДатаОкончанияРабот;	
			КонецЦикла;
			ДокОбъект.ДополнительныеСвойства.Вставить("НеЗаполнятьВидРаботы", Истина);
			Попытка
				ДокОбъект.Записать(РежимЗаписиДокумента.Проведение);
				МассивЗакрытия.Добавить(ДокОбъект.Ссылка);
			Исключение
				Сообщить(ОписаниеОшибки());
			КонецПопытки;
		КонецЕсли;
	КонецЦикла;
	
	Возврат МассивЗакрытия;
	
КонецФункции

#КонецОбласти
// Шворобей ВЮ 28.07.2025 https://yougile.collant.ru/team/ab6bad3a05c0/#HELP-5976
